/****************************************************************************/
//	FUNDAMENTOS DE PROGRAMACIÓN			RELACIÓN_VI				EJERCICIO_1
/****************************************************************************/
/*
	Jesús Muñoz Velasco 					Grupo:A2

	Enunciado:


	Entradas:

	Salidas:

*/
/****************************************************************************/
#include<iostream>
using namespace std;
/****************************************************************************/
//Declaración de constantes globales

/****************************************************************************/
//Declaración de tipos de datos

/****************************************************************************/
//Declaración de Clases/Objetos

/*****************************************************************************
  	Función:
	Parámetros:
	Devuelve:
............................................................................*/

/****************************************************************************/
/****************************************************************************/
int main()
{
	//Declaración de Datos
	cin.ignore();
	const char SEPARADOR=',';
	string cadena="51,5,5,3,3,22";
	
	int contador=1;
	int i=0;
	
	while(cadena.at(i)!=SEPARADOR && i<cadena.length())
	{
		cout<<cadena.at(i)<<"-";
		i++;
	}
	

	//Entradas

	

	//Cálculos



	//Salidas



	return 0;
}


